app/controllers/api/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @game = Game.with_attached_photos.find_by(id: params[:id])

SELECT "games".* FROM "games"
---
  def index
    @games = Game.with_attached_photos.all