app/controllers/api/games_genres_controller.rb

SELECT "games_genres".* FROM "games_genres"
SELECT "genres".* FROM "genres"
---
  def index
    @games_genres = GamesGenre.all