app/models/user.rb

  def self.find_by_credentials(username, password)
    user = self.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "guest"], ["LIMIT", 1]]